Repository: sudeshnb/old-sudoku
Catalog: lib/l10n/app_*.arb
Languages: si

source: Language
si: භාශාව

source: Hello World!
si: नमस्ते दुनिया!

# hello
source: Hello {username}
si: नमस्ते {username}

source: English
si: සිංහල

source: Reset
si: නැවත

source: Solve
si: විසඳන්න

source: New Game
si: නව ක්‍රීඩාව

source: Help
si: උදව්

source: Level
si: මට්ටම

source: Difficulty
si: දුෂ්කරතාව

source: Dark
si: අඳුරු

source: Light
si: ආලෝකය

source: Easy
si: පහසු

source: Medium
si: මධ්‍යම

source: Expert
si: දක්ෂ ලෙස

# noAchiev
source: No Achievements
si: ජයග්‍රහණ නැත

source: Best Time
si: හොඳම කාලය

source: Answer is
si: පිළිතුර

# splash
source: Growth up your brain
si: ඔබේ මොළය වර්ධනය කරන්න

# howtosolve
source: How to solve a sudoku puzzle
si: සුදෝකු ප්‍රහේලිකාවක් විසඳන්නේ කෙසේද?

# howtosolvediscr
source: Each sudoku puzzle consists of a 9-by-9 grid of numbers that has been partly filled in. The goal is to fill in all the remaining empty squares so that each row, each column, and each "box" contains all of the numbers from 1 to 9.
si: සෑම සුදෝකු ප්‍රහේලිකාවක්ම අර්ධ වශයෙන් පුරවා ඇති අංක 9 න් 9 ක ජාලයකින් සමන්විත වේ. ඉලක්කය වන්නේ ඉතිරි පේළි, එක් එක් තීරුව සහ සෑම "කොටුව " තුළම අඩංගු වන පරිදි ඉතිරි හිස් කොටු සියල්ල පුරවා ගැනීමයි. අංක 1 සිට 9 දක්වා.

source: Row
si: පේළිය

source: Column
si: තීරුව

source: Box
si: කොටුව

# rowDis
source: Each row must contain the numbers 1,2,3,4,5,6,7,8,9
si: සෑම පේළියකම 1,2,3,4,5,6,7,8,9 යන අංක අඩංගු විය යුතුය

# columnDis
source: Each column must contain the numbers 1,2,3,4,5,6,7,8,9
si: සෑම තීරුවකම 1,2,3,4,5,6,7,8,9 යන අංක අඩංගු විය යුතුය

# boxDis
source: Each sudoku consists of 9 "boxes." As with each row and column, each box must contain the numbers 1,2,3,4,5,6,7,8,9
si: සෑම සුදෝකු එකකම පෙට්ටි 9 "කින් සමන්විත වේ. " සෑම පේළියකම සහ තීරයේ මෙන්ම සෑම කොටුවකම 1,2,3,4,5,6,7,8,9 අංක තිබිය යුතුය
